megatr4n/stm32-flight-controller/src/hal/pwm_driver.cpp
#include "pwm_driver.h"
#include "stm32f1xx_hal.h"
#include <string.h>

TIM_HandleTypeDef htim2;

namespace HAL {
    bool PWMDriver::init() {

        memset(&htim2, 0, sizeof(htim2));
        htim2.State = HAL_TIM_STATE_RESET;
        htim2.Lock = HAL_UNLOCKED;

        __HAL_RCC_TIM2_CLK_ENABLE();
        __HAL_RCC_GPIOA_CLK_ENABLE();

        GPIO_InitTypeDef GPIO_InitStruct = {0};
        GPIO_InitStruct.Pin = GPIO_PIN_0 | GPIO_PIN_1 | GPIO_PIN_2 | GPIO_PIN_3;
        GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
        GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;
        HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

        htim2.Instance = TIM2;

        

        htim2.Init.Prescaler = (72 / 8) - 1;
        htim2.Init.CounterMode = TIM_COUNTERMODE_UP;
        htim2.Init.Period = 16000 - 1;
        htim2.Init.ClockDivision = TIM_CLOCKDIVISION_DIV1;
        htim2.Init.AutoReloadPreload = TIM_AUTORELOAD_PRELOAD_ENABLE;

        if (HAL_TIM_PWM_Init(&htim2) != HAL_OK)
        return false;

        TIM_OC_InitTypeDef sConfigOC = {0};
        sConfigOC.OCMode = TIM_OCMODE_PWM1;
        sConfigOC.Pulse = 1000;
        sConfigOC.OCPolarity = TIM_OCPOLARITY_HIGH;
        sConfigOC.OCFastMode = TIM_OCFAST_DISABLE;

        HAL_TIM_PWM_ConfigChannel(&htim2, &sConfigOC, TIM_CHANNEL_1);
        HAL_TIM_PWM_ConfigChannel(&htim2, &sConfigOC, TIM_CHANNEL_2);
        HAL_TIM_PWM_ConfigChannel(&htim2, &sConfigOC, TIM_CHANNEL_3);
        HAL_TIM_PWM_ConfigChannel(&htim2, &sConfigOC, TIM_CHANNEL_4);

        HAL_TIM_PWM_Start(&htim2, TIM_CHANNEL_1);
        HAL_TIM_PWM_Start(&htim2, TIM_CHANNEL_2);
        HAL_TIM_PWM_Start(&htim2, TIM_CHANNEL_3);
        HAL_TIM_PWM_Start(&htim2, TIM_CHANNEL_4);

        return true;
        
    };
    void PWMDriver::setMotorSpeeds(uint16_t m1, uint16_t m2, uint16_t m3, uint16_t m4) {
        TIM2 -> CCR1 = m1;
        TIM2 -> CCR2 = m2;
        TIM2 -> CCR3 = m3;
        TIM2 -> CCR4 = m4;
    }
}